{"class_name": "Model", "config": {"name": "model_17", "layers": [{"name": "input_18", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 168, 10], "dtype": "float32", "sparse": false, "name": "input_18"}, "inbound_nodes": []}, {"name": "reshape_34", "class_name": "Reshape", "config": {"name": "reshape_34", "trainable": true, "dtype": "float32", "target_shape": [168, 10, 1]}, "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 50, "kernel_size": [6, 10], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_34", 0, 0, {}]]]}, {"name": "dropout_34", "class_name": "Dropout", "config": {"name": "dropout_34", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "reshape_35", "class_name": "Reshape", "config": {"name": "reshape_35", "trainable": true, "dtype": "float32", "target_shape": [163, 50]}, "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}, {"name": "pre_skip_trans_17", "class_name": "PreSkipTrans", "config": {"name": "pre_skip_trans_17", "trainable": true, "dtype": "float32", "pt": 14, "skip": 11}, "inbound_nodes": [[["reshape_35", 0, 0, {}]]]}, {"name": "gru_34", "class_name": "GRU", "config": {"name": "gru_34", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["reshape_35", 0, 0, {}]]]}, {"name": "gru_35", "class_name": "GRU", "config": {"name": "gru_35", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 24, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["pre_skip_trans_17", 0, 0, {}]]]}, {"name": "dropout_35", "class_name": "Dropout", "config": {"name": "dropout_35", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["gru_34", 0, 1, {}]]]}, {"name": "post_skip_trans_17", "class_name": "PostSkipTrans", "config": {"name": "post_skip_trans_17", "trainable": true, "dtype": "float32", "skip": 11}, "inbound_nodes": [[["gru_35", 0, 1, {}], ["input_18", 0, 0, {}]]]}, {"name": "pre_ar_trans_17", "class_name": "PreARTrans", "config": {"name": "pre_ar_trans_17", "trainable": true, "dtype": "float32", "hw": 24}, "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["dropout_35", 0, 0, {}], ["post_skip_trans_17", 0, 0, {}]]]}, {"name": "flatten_35", "class_name": "Flatten", "config": {"name": "flatten_35", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["pre_ar_trans_17", 0, 0, {}]]]}, {"name": "flatten_34", "class_name": "Flatten", "config": {"name": "flatten_34", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "dense_35", "class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_35", 0, 0, {}]]]}, {"name": "dense_34", "class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_34", 0, 0, {}]]]}, {"name": "post_ar_trans_17", "class_name": "PostARTrans", "config": {"name": "post_ar_trans_17", "trainable": true, "dtype": "float32", "m": 10}, "inbound_nodes": [[["dense_35", 0, 0, {}], ["input_18", 0, 0, {}]]]}, {"name": "add_17", "class_name": "Add", "config": {"name": "add_17", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dense_34", 0, 0, {}], ["post_ar_trans_17", 0, 0, {}]]]}], "input_layers": [["input_18", 0, 0]], "output_layers": [["add_17", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}