System Info:
	Python version: 3.6.7 (default, Dec  6 2019, 07:03:06) [MSC v.1900 64 bit (AMD64)]
	TensorFlow version: 1.11.0
	Keras version: 2.1.6-tf

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: Adam
	Learning Rate: 0.001
	Batch Size: 64
	Number of Epochs: 50

Training Results:
	Loss: 0.020501404710040617
	Rse: 0.32198690635790905
	Corr: 0.8556335514663352

Validation Results:
	Loss: 0.05132098384041643
	Rse: 0.8086077176109063
	Corr: -0.3196390689868954

Model Summary:
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            (None, 166, 14)      0                                            
	__________________________________________________________________________________________________
	reshape (Reshape)               (None, 166, 14, 1)   0           input_1[0][0]                    
	__________________________________________________________________________________________________
	conv2d (Conv2D)                 (None, 161, 1, 50)   4250        reshape[0][0]                    
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 161, 1, 50)   0           conv2d[0][0]                     
	__________________________________________________________________________________________________
	reshape_1 (Reshape)             (None, 161, 50)      0           dropout[0][0]                    
	__________________________________________________________________________________________________
	pre_skip_trans (PreSkipTrans)   (None, 6, 50)        0           reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru (GRU)                       [(None, 50), (None,  15150       reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru_1 (GRU)                     [(None, 5), (None, 5 840         pre_skip_trans[0][0]             
	__________________________________________________________________________________________________
	dropout_1 (Dropout)             (None, 50)           0           gru[0][1]                        
	__________________________________________________________________________________________________
	post_skip_trans (PostSkipTrans) (None, 130)          0           gru_1[0][1]                      
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	pre_ar_trans (PreARTrans)       (None, 24)           0           input_1[0][0]                    
	__________________________________________________________________________________________________
	concatenate (Concatenate)       (None, 180)          0           dropout_1[0][0]                  
	                                                                 post_skip_trans[0][0]            
	__________________________________________________________________________________________________
	flatten_1 (Flatten)             (None, 24)           0           pre_ar_trans[0][0]               
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 180)          0           concatenate[0][0]                
	__________________________________________________________________________________________________
	dense_1 (Dense)                 (None, 1)            25          flatten_1[0][0]                  
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 14)           2534        flatten[0][0]                    
	__________________________________________________________________________________________________
	post_ar_trans (PostARTrans)     (None, 14)           0           dense_1[0][0]                    
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	add (Add)                       (None, 14)           0           dense[0][0]                      
	                                                                 post_ar_trans[0][0]              
	==================================================================================================
	Total params: 22,799
	Trainable params: 22,799
	Non-trainable params: 0
	__________________________________________________________________________________________________
