System Info:
	Python version: 3.6.7 (default, Dec  6 2019, 07:03:06) [MSC v.1900 64 bit (AMD64)]
	TensorFlow version: 1.11.0
	Keras version: 2.1.6-tf

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: Adam
	Learning Rate: 0.001
	Batch Size: 64
	Number of Epochs: 50

Training Results:
	Loss: 0.003975650439880784
	Rse: 0.08699768724439054
	Corr: 0.9919224232357898

Validation Results:
	Loss: 0.007504947909896125
	Rse: 0.1269380416992908
	Corr: 0.8840994116915483

Model Summary:
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            (None, 168, 15)      0                                            
	__________________________________________________________________________________________________
	reshape (Reshape)               (None, 168, 15, 1)   0           input_1[0][0]                    
	__________________________________________________________________________________________________
	conv2d (Conv2D)                 (None, 163, 1, 50)   4550        reshape[0][0]                    
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 163, 1, 50)   0           conv2d[0][0]                     
	__________________________________________________________________________________________________
	reshape_1 (Reshape)             (None, 163, 50)      0           dropout[0][0]                    
	__________________________________________________________________________________________________
	pre_skip_trans (PreSkipTrans)   (None, 7, 50)        0           reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru (GRU)                       [(None, 50), (None,  15150       reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru_1 (GRU)                     [(None, 5), (None, 5 840         pre_skip_trans[0][0]             
	__________________________________________________________________________________________________
	dropout_1 (Dropout)             (None, 50)           0           gru[0][1]                        
	__________________________________________________________________________________________________
	post_skip_trans (PostSkipTrans) (None, 115)          0           gru_1[0][1]                      
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	pre_ar_trans (PreARTrans)       (None, 24)           0           input_1[0][0]                    
	__________________________________________________________________________________________________
	concatenate (Concatenate)       (None, 165)          0           dropout_1[0][0]                  
	                                                                 post_skip_trans[0][0]            
	__________________________________________________________________________________________________
	flatten_1 (Flatten)             (None, 24)           0           pre_ar_trans[0][0]               
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 165)          0           concatenate[0][0]                
	__________________________________________________________________________________________________
	dense_1 (Dense)                 (None, 1)            25          flatten_1[0][0]                  
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 15)           2490        flatten[0][0]                    
	__________________________________________________________________________________________________
	post_ar_trans (PostARTrans)     (None, 15)           0           dense_1[0][0]                    
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	add (Add)                       (None, 15)           0           dense[0][0]                      
	                                                                 post_ar_trans[0][0]              
	==================================================================================================
	Total params: 23,055
	Trainable params: 23,055
	Non-trainable params: 0
	__________________________________________________________________________________________________
